Revit 2024 API
FlexPipe.StartTangent Property
 Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public XYZ StartTangent { get; set; }
Visual Basic
Public Property StartTangent As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ StartTangent {
	XYZ^ get ();
	void set (XYZ^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
FlexPipe Class
Autodesk.Revit.DB.Plumbing Namespace